import React from "react";

import { Html } from "@mui/icons-material";
let contents = [
  {
  heading: "ফ্রন্ট-এন্ড ডেভেলপমেন্ট বেসিক ",
  content: "এডভান্সড ফ্রন্ট-এন্ড ডেভেলপমেন্ট শেখার আগে বেসিক নিয়ে আপনার ধারণা থাকা জরুরি। তাই প্রোগ্রামের শুরুতে HTML, CSS, Bootstrap নিয়ে ধারণা পেয়ে যাবেন।"
},
{
  heading: "কমপ্লিট ফ্রন্ট এন্ড ডেভেলপমেন্ট",
  content: "ফ্রন্ট এন্ডের জন্য এ প্রোগ্রামে সবচেয়ে ডিমান্ডিং জাভাস্ক্রিপ্ট লাইব্রেরী REACT কে শিখবেন। এর সাহায্যে শক্তিশালী ও স্কেলেবল ওয়েব এপ্লিকেশন ডেভেলপ করা শিখবেন, একেবারে শূন্য থেকে। কমপ্লিট নেটিভ মোবাইল অ্যাপ ডেভেলপ করে তার সাথে ওয়েবের কোড কানেক্ট করে মাল্টিপ্ল্যাটফর্ম এপ্লিকেশন ডেভেলপমেন্ট শিখবেন"
},{
  heading: "ফ্রন্ট-এন্ড ডেভেলপমেন্ট বেসিক ",
  content: "এডভান্সড ফ্রন্ট-এন্ড ডেভেলপমেন্ট শেখার আগে বেসিক নিয়ে আপনার ধারণা থাকা জরুরি। তাই প্রোগ্রামের শুরুতে HTML, CSS, Bootstrap নিয়ে ধারণা পেয়ে যাবেন।"
},
{
  heading: "কমপ্লিট ফ্রন্ট এন্ড ডেভেলপমেন্ট",
  content: "ফ্রন্ট এন্ডের জন্য এ প্রোগ্রামে সবচেয়ে ডিমান্ডিং জাভাস্ক্রিপ্ট লাইব্রেরী REACT কে শিখবেন। এর সাহায্যে শক্তিশালী ও স্কেলেবল ওয়েব এপ্লিকেশন ডেভেলপ করা শিখবেন, একেবারে শূন্য থেকে। কমপ্লিট নেটিভ মোবাইল অ্যাপ ডেভেলপ করে তার সাথে ওয়েবের কোড কানেক্ট করে মাল্টিপ্ল্যাটফর্ম এপ্লিকেশন ডেভেলপমেন্ট শিখবেন"
},{
  heading: "ফ্রন্ট-এন্ড ডেভেলপমেন্ট বেসিক ",
  content: "এডভান্সড ফ্রন্ট-এন্ড ডেভেলপমেন্ট শেখার আগে বেসিক নিয়ে আপনার ধারণা থাকা জরুরি। তাই প্রোগ্রামের শুরুতে HTML, CSS, Bootstrap নিয়ে ধারণা পেয়ে যাবেন।"
},
{
  heading: "কমপ্লিট ফ্রন্ট এন্ড ডেভেলপমেন্ট",
  content: "ফ্রন্ট এন্ডের জন্য এ প্রোগ্রামে সবচেয়ে ডিমান্ডিং জাভাস্ক্রিপ্ট লাইব্রেরী REACT কে শিখবেন। এর সাহায্যে শক্তিশালী ও স্কেলেবল ওয়েব এপ্লিকেশন ডেভেলপ করা শিখবেন, একেবারে শূন্য থেকে। কমপ্লিট নেটিভ মোবাইল অ্যাপ ডেভেলপ করে তার সাথে ওয়েবের কোড কানেক্ট করে মাল্টিপ্ল্যাটফর্ম এপ্লিকেশন ডেভেলপমেন্ট শিখবেন"
}

]

const courseEndPartContents = [
  {
    heading: "কমপ্লিট ফ্রন্ট এন্ড ডেভেলপমেন্ট",
    content: "যারা দেশী-বিদেশী সফটওয়্যার কোম্পানি ও আইটি ফার্মগুলোতে কিংবা কোনো কোম্পানির প্রোডাক্ট ডেভেলপমেন্ট টিম জয়েন করতে চান। অথবা যারা বিভিন্ন অনলাইন ফ্রিল্যান্সিং মার্কেটপ্লেসে কিংবা ইন্ডিপেন্ডেন্ট টেকনিক্যাল কনসালট্যান্ট হিসাবে কাজ করতে চান।"
},
{
  heading: "কমপ্লিট ফ্রন্ট এন্ড ডেভেলপমেন্ট",
  content: "যারা দেশী-বিদেশী সফটওয়্যার কোম্পানি ও আইটি ফার্মগুলোতে কিংবা কোনো কোম্পানির প্রোডাক্ট ডেভেলপমেন্ট টিম জয়েন করতে চান। অথবা যারা বিভিন্ন অনলাইন ফ্রিল্যান্সিং মার্কেটপ্লেসে কিংবা ইন্ডিপেন্ডেন্ট টেকনিক্যাল কনসালট্যান্ট হিসাবে কাজ করতে চান।"
}
]
const CourseDescription = () => {
  return (
    <>
    <div className="course__description">
      {contents.map(c=> {
        return(
          <>
        <div>
        <h3>{c.heading}</h3>
      </div>
      <div className="gutter__div"></div>

      <hr />
    <div className="gutter__div"></div>

      <div>
        <p>
         {c.content}
        </p>
      </div>
    <div className="gutter__div"></div>

          </>
        )
      })}
      
    </div>
    {/* <div className="gutter__div"></div> */}
    

    {/********************************************** end part *******************************************************/}

<div>
  {courseEndPartContents.map(c=> {
    return (
      <>
      <div className="course__end__part">
            <div className="course__end__part__left">
              <div className="card__img">
                <Html
                  color="white"
                  sx={{
                    backgroundColor: "#a7174e",
                  }}
                />
              </div>
            </div>
            <div className="course__end__part__right">
            <h3>{c.heading}</h3>
            <div className="gutter__div"></div>
            <p>
             {c.content}
            </p>
            </div>
      </div>
      <div className="gutter__div"></div>
      
      </>
    )
  })}
    
</div>
  </>
  )
}

export default CourseDescription